app/controllers/projects_controller.rb

SELECT  "projects".* FROM "projects" ORDER BY "projects"."created_at" DESC LIMIT ?  [["LIMIT", 10]]
---
  def index
    @projects = Project.order(created_at: :desc).limit(10)